# The Basics

## Simple SELECTs
1) Query all the data in the `pets` table.
2) Query only the first 5 rows of the `pets` table.
3) Query only the names and ages of the pets in the `pets` table.
4) Query the pets in the `pets` table, sorted youngest to oldest.
5) Query the pets in the `pets` table alphabetically.
6) Query all the male pets in the `pets` table.
7) Query all the cats in the `pets` table.
8) Query all the pets in the `pets` table that are at least 5 years old.
9) Query all the male dogs in the `pets` table. Do not include the sex or species column, since you already know them.
10) Get all the names of the dogs in the `pets` table that are younger than 5 years old.
11) Query all the pets in the `pets` table that are either male dogs or female cats.
12) Query the five oldest pets in the `pets` table.
13) Get the names and ages of all the female cats in the `pets` table sorted by age, descending.
14) Get all pets from `pets` whose names start with P.
15) Select all employees from `employees_null` where the salary is missing.
16) Select all employees from `employees_null` where the salary is below $35,000 or missing.
17) Select all employees from `employees_null` where the job title is missing. What do you see?
18) Who is the newest employee in `employees`? The most senior?
19) Select all employees from `employees` named Thomas.
20) Select all employees from `employees` named Thomas or Shannon.
21) Select all employees from `employees` named Robert, Lisa, or any name that begins with a J. In addition, only show employees who are _not_ in sales. This will be a little bit of a longer query.
    * _Hint:_ There will only be 6 rows in the result.

## Column Operations
22) Query the top 5 rows of the `employees` table to get a glimpse of these new data.
23) Query the `employees` table, but convert their salaries to Euros. 
    * _Hint:_ 1 Euro = 1.1 USD.
    * _Hint2:_ If you think the output is ugly, try out the `ROUND()` function.
24) Repeat the previous problem, but rename the column `salary_eu`.
25) Query the `employees` table, but combine the `firstname` and `lastname` columns to be "Firstname, Lastname" format. Call this column `fullname`. For example, the first row should contain `Thompson, Christine` as `fullname`. Also, display the rounded `salary_eu` instead of `salary`.
    * _Hint:_ The string concatenation operator is `||`
26) Query the `employees` table, but replace `startdate` with `startyear` using the `SUBSTR()` function. Also include `fullname` and `salary_eu`.
27) Repeat the above problem, but instead of using `SUBSTR()`, use `STRFTIME()`.
28) Query the `employees` table, replacing `firstname`/`lastname` with `fullname` and `startdate` with `startyear`. Print out the salary in USD again, except format it with a dollar sign, comma separators, and no decimal. For example, the first row should read `$123,696`. This column should still be named `salary`.
    * _Hint:_ Check out SQLite's `printf` function.
    * _Hint2:_ The format string you'll need is `$%,.2d`. You should read more about such formatting strings as they're useful in Python, too!

**Note:** For the next few problems, you'll probably want to use `CASE`/`WHEN` statements.

29) Last year, only salespeople were eligible for bonuses. Create a column `bonus` that is "Yes" if you're eligible for a bonus, otherwise "No".
30) This year, only sales people with a salary of $100,000 or higher are eligible for bonuses. Create a `bonus` column like in the last problem for salespeople with salaries at least $100,000.
31) Next year, the bonus structure will be a little more complicated. You'll create a `target_comp` column which represents an employee's target total compensation after their bonus. Here is the company's bonus structure:

* Salespeople who make more than $100,000 will be eligible for a 10% bonus.
* Salespeople who make less than $100,000 will be eligible for a 5% bonus.
* Administrators will also be eligible for a 5% bonus.
* Anyone who does not meet any of the above descriptions is not eligible for a bonus.

Create this `target_comp` column, making sure to format _both_ the `salary` and `target_comp` columns nicely (ie, with dollar signs and comma separators)

In [1]:
# Import Pandas and Create_Engine

from sqlalchemy import create_engine
import pandas as pd
import sqlite3

con = sqlite3.connect("ladder.db")

1) Query all the data in the pets table.

In [2]:
pd.read_sql("SELECT * FROM pets;", con)

DatabaseError: Execution failed on sql 'SELECT * FROM pets;': no such table: pets

 2) Query only the first 5 rows of the pets table.

In [3]:
sql = '''
SELECT *
FROM pets
LIMIT 5
'''
pd.read_sql_query(sql, con)

DatabaseError: Execution failed on sql '
SELECT *
FROM pets
LIMIT 5
': no such table: pets

3) Query only the names and ages of the pets in the pets

In [ ]:
sql = '''
SELECT name, age
FROM pets
LIMIT 5
'''
pd.read_sql_query(sql, con)

4) Query the pets in the `pets` table, sorted youngest to oldest.

In [ ]:
sql = '''
SELECT species, age
FROM pets
ORDER BY age 
LIMIT 5;
'''
pd.read_sql_query(sql, con)

5) Query the pets in the `pets` table alphabetically.

In [ ]:
sql = '''
SELECT species
FROM pets
ORDER BY species;
'''
pd.read_sql_query(sql, con)

6) Query all the male pets in the `pets` table.

In [ ]:
sql = '''
SELECT *
FROM pets
WHERE sex = 'M';
'''
pd.read_sql_query(sql, con)

7) Query all the cats in the `pets` table.

In [ ]:
sql = '''
SELECT *
FROM pets
WHERE species = 'cat';
'''
pd.read_sql_query(sql, con)

8) Query all the pets in the `pets` table that are at least 5 years old.

In [ ]:
sql = '''
SELECT *
FROM pets
WHERE age >= 5;
'''
pd.read_sql_query(sql, con)

9) Query all the male dogs in the `pets` table. Do not include the sex or species column, since you already know them.

In [ ]:
sql = '''
SELECT name, age
FROM pets
WHERE (sex = 'M') and (species = 'dog');
'''
pd.read_sql_query(sql, con)

10) Get all the names of the dogs in the `pets` table that are younger than 5 years old.

In [ ]:
sql = '''
SELECT name
FROM pets
WHERE (age < 5) AND (species = 'dog');
'''
pd.read_sql_query(sql, con)

11) Query all the pets in the `pets` table that are either male dogs or female cats.

In [ ]:
sql = '''
SELECT *
FROM pets
WHERE (sex = 'M' AND species = 'dog') OR \
(sex = 'F' AND species = 'cat');
'''
pd.read_sql_query(sql, con)

12) Query the five oldest pets in the `pets` table.

In [ ]:
sql = '''
SELECT *
FROM pets
ORDER BY age DESC
LIMIT 5;
'''
pd.read_sql_query(sql, con)

13) Get the names and ages of all the female cats in the `pets` table sorted by age, descending.

In [ ]:
sql = '''
SELECT name, age
FROM pets
WHERE species = 'cat' AND sex = 'F'
ORDER BY age DESC;
'''
pd.read_sql_query(sql, con)

14) Get all pets from `pets` whose names start with P.

In [ ]:
sql = '''
SELECT *
FROM pets
WHERE name LIKE "P%%"
ORDER BY age DESC;
'''
pd.read_sql_query(sql, con)

15) Select all employees from `employees_null` where the salary is missing.

In [ ]:
sql = '''
SELECT *
FROM employees_null
WHERE salary IS NULL;
'''
pd.read_sql_query(sql, con)

16) Select all employees from `employees_null` where the salary is below $35,000 or missing.

In [ ]:
sql = '''
SELECT *
FROM employees_null
WHERE salary < 35000 OR salary IS NULL;
'''
pd.read_sql_query(sql, con)

17) Select all employees from `employees_null` where the job title is missing. What do you see?

In [ ]:
sql = '''
SELECT *
FROM employees_null
WHERE job IS NULL;
'''
pd.read_sql_query(sql, con)

18) Who is the newest employee in `employees`? The most senior?

In [ ]:
sql = '''
SELECT lastname, firstname, startdate
FROM employees 
WHERE startdate = (SELECT MAX(startdate) FROM employees)\
OR startdate = (SELECT MIN(startdate) FROM employees);
'''
pd.read_sql_query(sql, con)

19) Select all employees from `employees` named Thomas.

In [ ]:
sql = '''
SELECT firstname || " " || lastname as "Name"
FROM employees
WHERE LOWER(firstname) = "thomas" OR LOWER(lastname) = "thomas";

'''
pd.read_sql_query(sql, con)

20) Select all employees from `employees` named Thomas or Shannon.

In [ ]:
sql = '''
SELECT firstname || " " || lastname as "Name"
FROM employees
WHERE (LOWER(firstname) = "thomas" OR LOWER(lastname) = "thomas") OR \
(LOWER(firstname) = 'shannon' or LOWER(lastname) = "shannon");

'''
pd.read_sql_query(sql, con)

21) Select all employees from `employees` named Robert, Lisa, or any name that begins with a J. In addition, only show employees who are _not_ in sales. This will be a little bit of a longer query.
    * _Hint:_ There will only be 6 rows in the result.

In [ ]:
sql = '''
SELECT firstname || " " || lastname as "Name", job
FROM employees
WHERE job != "Sales" AND
((LOWER(firstname) = "robert" OR LOWER(lastname) = "robert") OR 
(LOWER(firstname) = 'lisa' or LOWER(lastname) = "or")
OR LOWER(firstname) LIKE "j%%" OR LOWER(lastname) LIKE "j%%") 
;

'''
pd.read_sql_query(sql, con)